// конвертация и вывод температуры (1)
// let tempC = +prompt("Введите температуру по Цельсию");
// let tempF = (9 / 5) * tempC + 32;
// alert("Температура в градусах Фаренгейта: " + tempF.toFixed(2));

// Работа с переменными (2)
// let admin;
// let name = "Василий";
// admin = name;
// alert(admin);

// 4 задание
// выражение 1000 + "108" будет равно 1000108

// Поменять значения переменных без использования третьей
var a = 10;
var b = 30;

a = a + b;
b = a - b;
a = a - b;

console.log("a = " + a, "b = " + b);




